const pass = {
  ['1']: ['xxA???.', 'IY', 'SsL', 'Axi0'],
  ['2']: ['xzZ', ':""":', 'is?>is', '900~!'],
  ['3']: ['SDX', '?y@~', '[]art', ':l():'],
  ['4']: ['l":as', 'javL()(@`', '0_)(0', ';**()**>'],
  ['5']: ['4rf', '9MoHate#', 'ItisxI$', '*78_hate??'],
  ['6']: ['plk', '>>?>>', 'pIUsd13', '(h)uy:;'],
  ['7']: ['*tri', '*&&$$$@!', 'ytuP@#', '__+=*(', 'IU'],
  ['8']: ['dep*', '@@##*', '...,|', 'yZx2%', '9'],
  ['9']: ['@#@SS', 'B_', '!@', 'BT'],
  ['0']: ['is', 'X1~', 'IK', ')88@s'],
  [',']: [':::L', 'Oo', 'LA', 'TB'],
  ['A']: ['oaOz', 'CP', 'PX', 'oO'],
  ['B']: ['xIx', 'BT', 'Ss', 'I?><><'],
  ['C']: ['xI*', 'AI', 'TX', ':;R'],
  ['D']: ['xI$', 'S++', '++r', ';:Oo'],
  ['Q']: ['XI?/xq1', 'OoS', 'TBr', 'OOw'],
  ['W']: ['xIIII', 'wOW', 'UIq', 'SsPX'],
  ['E']: ['ooxo', '001', 'Ax_!@', '~!Q', 'iOow'],
  ['R']: ['@gmail[', '19', 'iI:"', 'AxoO'],
  ['T']: ['@com@', '@"', '!#', 'Cp'],
  ['Y']: ['@mnx>?', 'cP', 'que:', 'zZ'],
  ['Ý']: ['xhHj', 'POOI', 'Tlin', '_)L'],
  ['Ỳ']: ['K@b', 'cq', 'AAA', 'TTX'],
  ['Ỷ']: ['hahaQ<', 'llAl', 'OIKJ', '[Qw'],
  ['Ỹ']: ['MnMTY', 'pppo0', '090', '?.'],
  ['Ỵ']: ['mr', '998', '19>1', 'Ao'],
  ['Ụ']: ['MyR', 'UIL', 'att~`', '::""'],
  ['U']: ['#Pui', '><q', 'iUAx!@', 'UlKq`'],
  ['Ú']: ['#Pui_', '+><q', 'iUA99@', '001~'],
  ['Ù']: ['00', '(nm@!DD', '!@*&', '6<<>>'],
  ['Ủ']: ['PPPO', 'isIs', ':::LL', 'PX)o'],
  ['Ũ']: ['pppo', '?.12*', '>>>1', '10<<<'],
  ['Ư']: ['*78', '><q+', '12*90', '~```.'],
  ['Ứ']: ['hate??', '_=Oo?', '~>p', '_jy=LKI'],
  ['Ử']: ['<3mM', '_iio', '?.89', '98/>'],
  ['Ừ']: ['?|?}', '009?|?}', 'AAA?>', '~111``'],
  ['Ữ']: ['xHhj', '888', '9:', 'UUUYhhn@1``~jjjK_?>L'],
  ['Ự']: ['xIx_', '>ll832', 'lesLoii!@', '$%l'],
  ['I']: ['#Love', 'N`k', 'IOE', '_@$_'],
  ['Í']: ['hate>??', 'YYYYYYYYYYYYYYYY8', 'kjRPng', '||}?X'],
  ['Ỉ']: ['<3Mm', 'LKuNNNM', 'UIO_&IQW*', '2344'],
  ['Ì']: ['..,,,K1', 'Korre', 'IyuY', '+><qP?>', '?..<><>'],
  ['Ĩ']: [',,..``', '[[]]', '@34', 'MNNNMQQQQQ'],
  ['Ị']: ['@!+=', 'Pooo', '<,,?/', '231100'],
  ['Ô']: ['LAK#$a', 'rgh', 'colors', '<nnnL,.'],
  ['Ố']: ['?..<', '?..>', 'OP[[]art', '#43'],
  ['Ồ']: ['sss$', '#344,', '(889)0', '<>>PHI'],
  ['Ổ']: ['|||', '{{{}}}', '98,..?', '<<t~~~'],
  ['Ỗ']: ['<#3', 'ccCC', ';:;s', '$#%'],
  ['Ộ']: ['Vi|et<3Ja~`pan_', 'Ja~`pan_', '<nnmms', '@o88'],
  ['Ó']: ['oooo_++', 'hgasss', 'SSss55', '#$$@!~'],
  ['Ò']: ['chk`', 'YYU', 'keyqOI', 'UYYs'],
  ['Õ']: ['$$$%~', 'IEWEW', '+++_', 'Vi'],
  ['Ỏ']: ['?/?}', 'ooiiE@#', '43999', 'Ejjhkjk'],
  ['Ọ']: ['pp[]]', 'oouuummmvvv', '43321', ':[[]||A'],
  ['O']: ['#hate', 'oiuuayWWW', 'QQW@.,.', '...FFRT...'],
  ['Ơ']: ['jl', 'Poke', '@!#+=', '<<..$.'],
  ['Ờ']: ['`:`:@', 'llluuyv', '[[```', 'p@...FFRT'],
  ['Ớ']: [',,,,{}', 'Es4', 'exte', 'you'],
  ['Ở']: ['NBVC', '322_4.', 'Nothing', 'Y$5544s'],
  ['Ỡ']: ['3<09', '3<', '<09', '::""",_:'],
  ['Ợ']: ['.../zx', '(*(((896', '<093<', 'Vip@....'],
  ['S']: ['@%^&*)xshey', '19iI', '#####', 'l?,<MWne'],
  ['F']: ['fgs_shey', 'colorsO', 'Q?.89', 'TBW@'],
  ['G']: ['xshey', 'qwoi', 'K.A', '0003030'],
  ['H']: ['oixmxn', 'q_@<>q', 'OP[]]', 'MNNNM_'],
  ['J']: ['oixmxn*$$001', '%4333>MN', '$$###', '0972223'],
  ['K']: ['*Hfx?***Irrrj', '*(', '324@', '**&**&**&'],
  ['L']: ['PmnaR$', 'uuuioqcvh', 'TABL@#', 'Heys)5('],
  ['Z']: ['<s(89', '657<>,7Mnnjh', 'kkk_$%kkkke', '**9[]]"}/'],
  ['X']: ['ja<span?.iiui', '712230i', 'ggffgghhhtt', 'IwuJJHS?<&'],
  ['V']: ['kl__lk?Liet%', 'YtyHG', 'QRW(/TAH', '988!@'],
  ['N']: ['*V$$001:mmm', 'V.l', 'SDD&^>,,,', 'RTTTTTYLOV;;SKAHHSYE_#$$ssddf98877<<>>>'],
  ['M']: ['yOpy(89', 'AsOIIO', 'Z.i', 'IIUOIM,KK;;65778CDFFHHYYTTUUIILLKMM>????C!!!'],
  ['a']: ['ufHH%^a', 'h)_y_PmR$', 'FS', '000898'],
  ['q']: ['EtOEt/zx', '?/;{', '425T(II>,,,.', 'BVVGBn_()'],
  ['w']: ['pOp><_$$001', 'nM@n', '?pOP', '3111!luy', '<'],
  ['e']: ['<09:3(:`:@', '?|?', 'nNmN', 'ke$$'],
  ['r']: ['t/?', '"[[]][:', 'P{};', 'RTl?,'],
  ['t']: ['#qhu)yqqqq', '.<.>.', '?/.<.>/', '##!}}'],
  ['y']: ['det2+', '????', 'lTTl', '<....>'],
  ['ý']: ['Fire', 'Phire', 'o56', 'CVMNJ:'],
  ['ỳ']: ['Tyek', 'GffG', 'KJHJas', 'nBbBn'],
  ['ỹ']: ['?0?x', '_9_0', '[[]}', '|:|'],
  ['ỷ']: ['XZyc', '@@', 'T_T', ':)-'],
  ['ỵ']: ['iiui', ',,,,19', 'gay', 'lesibian'],
  ['u']: ['lineKiki', ';;;;', '[[', '.'],
  ['ú']: ['AsL', 'POP,', '&^*|', 'WEAR'],
  ['ù']: ['OPI', '7749*', 'https://@#.com', 'Ms))'],
  ['ủ']: ['AIkk@', '$%%%%', '___<>', '(0)'],
  ['ũ']: ['<<>>::L', 'TA', 'RR6+_', '~1po@3'],
  ['ụ']: ['UYHJ?.', 'pP', ',,6', 'B.9'],
  ['i']: ['@$#$AmN', '_hu)y_Pmna', '989', '}'],
  ['í']: ['Mikka', 'O9:;', '~.<', '.`.'],
  ['ỉ']: ['asmZfold', 'JHJ///', 'Mn_$', 'Olap'],
  ['ĩ']: ['[china', '[[', '++]', '92*'],
  ['ì']: ['Y7Y6Yv', '7777', '(II', '$$ke'],
  ['ị']: ['OIOllll', 'pPp', '%^%', 'NHkkj>,><'],
  ['o']: ['CZXy!y@', '>?/....<//', '&#J880', '##~{{'],
  ['ó']: ['UJ001', 'FSFS', 'oIUJ', '444_'],
  ['ò']: ['*87!_!', 'IOOI?OI', '<>|{?}', '.,27'],
  ['ỏ']: ['#4a', '"":"2:"', '#@@#!', 'SOS'],
  ['õ']: ['Rtyz!', 'UYUIJ', ';:;"', '<...<...>...<'],
  ['ọ']: ['Ujx', '.mp3', 'media', 'pccp'],
  ['ô']: ['LKKL56', '&*&*&@', '///..??,', '1!2!2!3'],
  ['ộ']: ['biden', '7&*0)', '43210', 'NuiUY<,'],
  ['ổ']: ['Ha?haOIO', '::<>()', 'na?rear', 'UiUi'],
  ['ố']: ['<Mjjja', 'Key)(.', 'hayuOl', '<<<<***>>>'],
  ['ỗ']: ['G1_zzCn?', 'uahxEE', 'GGHH,..', '435ANj'],
  ['ồ']: ['MLSn', '7688ka', 'jkaoOY', '.mpa4md'],
  ['ơ']: ['ChetCk~.', 'cK~', '.!.998', ',mmn#22`!'],
  ['ở']: ['4450001', '><><_)', '%445>:12', 'ewrafRRR'],
  ['ớ']: ['LK~$@', '&^777yyyh)99>lk', '55540+', '+_+0'],
  ['ỡ']: ['<>();ChetCk~', '*92|', '+_+@@', '_(90'],
  ['ờ']: ['[[[[**I**', '@#p:?', 'bhUYi', '#@4'],
  ['ợ']: ['4a#', '??Lj+!_', 'Mju009#', '*7788?"'],
  ['p']: ['XNzzCnVN?s%<>K', 'Oiiaj?_)', 'bQWQQ', '2#+5NK'],
  ['s']: ['***VZq9_0', 'L,//,', '(()):i', '//..@cD'],
  ['f']: ['!@:fgklVV?/', 'lk...l', '::!~::', '#?Hay?#_9'],
  ['d']: ['***!@:', '809,.,', '__p', '_FS_'],
  ['g']: ['OUxIOPp|_', 'kj_444', '[8__p', '*87_'],
  ['h']: ['kl__lk_*87', '666g:yu', '100_0_?L', '2#+5N'],
  ['j']: ['OPI;jhjhjhAS', '==K', 'Hoai', '@_?LM/'],
  ['k']: ['60$$$;small_', '@+g_', '//', 'n<07'],
  ['l']: ['ChetCk~`', '`.', '((,M,))', '>,(90L[]'],
  ['z']: ['MU@3+=!', '4==/', '0:_%$', '!!~~.<'],
  ['x']: ['><,<<>?+', '2+1=s10', '11G11', ';;";;8__p'],
  ['c']: ['mbn***I***hdj22f', '4_//', 'v_V', '88^'],
  ['v']: ['rt%%:::**x*', '??//+L', '{{{{[[[[**I', '(()):i`'],
  ['b']: ['!_!;60$$$_', 'ZzZzZ', '90098_FS', '0:LM/'],
  ['n']: ['!_!_more#', '=*x', '*78.Poo', 'Poo'],
  ['m']: ['*Y:3????small_=', 'vOcI', '<...#$~~.<', '876501'],
  ['-']: ['xZx60$$$', 'm9900', '_(_)0', '>>..??..<<'],
  ['.']: ['88t..MNM', 'JKKJjk', 'tiktok', '>'],
  [':']: ['!@:_ChetCk', 'L$%', '!!o.', '9999//,'],
  ['!']: ['!!@S*..M,NM', 'O,!!', '{..', 'Reeef:k*{'],
  ['@']: ['Y:3????', '><kk*&kkdj', '^%%%^', 'EWWE'],
  ['#']: ['#$S_!@:', '_72&&', '?,.*())', '[[[B999//,'],
  ['$']: ['#$Sx7665', '!AMNM_72&&', '!', '@_'],
  ['%']: [':ALSKXfc', '100%', '_Facebook', '_tiktok'],
  ['^']: ['s%<>K', 'Facebook_', '#@$%?..#', '766@#99'],
  ['&']: ['aD;l+*x*x*', '**xcG', '**((>><', '<34444'],
  ['*']: ['*((Msf?a', 'viTyLs$', '<><><><>', '!<>0+_'],
  ['(']: ['7aa?><_', '?>??><', '*89*7&', ')(('],
  [')']: ['?*x*x.se*', ')((+', '^556^', '#@?NAsa'],
  ['_']: ['_0_1_:#$S_!@', '888934mp3', 'fork', '{}<>::'],
  ['+']: ['***x_xxxxx56', '>_5', 'biGs', '440967'],
  ['=']: ['?A?v?v', 'iHateU*', 'kklu&', 'YYT877&'],
  ['`']: ['...ZS', 'jw2@', '700.800', '!@!`/,'],
  ['~']: ['..MNM___', '!|@#', '887??:"', 'iooio()'],
  ['{']: ['X{{.S', 'JjJ', 'TT_TY', ':":_090'],
  ['}']: ['xx{{.S', '{{', '=><=', '98$'],
  ['[']: ['*x*x*', 'IoIO0', '(9)9)', '88890...'],
  [']']: ['**x*', 'yyTyUU', 'HH1', '$77777777777777777777'],
  ['"']: ['***x', '2!!,', 'mnnnnnm&^', '0001aaE'],
  ['|']: ['___..MNM', '@%LuuKaM', 'MMM|['],
  ['<']: ['*qmz*', '@UUQw#$', '$#ooI7', '999%'],
  ['>']: ['*&*&*', 'word_)(', '()*()_', '*&8*'],
  ['/']: ['*x*&*', '/_/}{', '*(*$*)', 'ThikNht'],
  ['?']: ['*&*x*x', 'H0H776', 'lSKL', '?<_^Mio'],
  ['Â']: ['Az1+9000', '&66uu()?', '$$%$$::;;1', 'limit'],
  ['Á']: ['0001+0009', '++090', 'AD_(+L', 'TRT<,>'],
  ['Ă']: ['0002_Az1', 'KjnGG', '*&_*&*,', ':KLK::'],
  ['Ấ']: ['0003+0008', 'ABVAS', 'NHY_((', '@$+=='],
  ['Ắ']: ['0004_+089', 'YYUYY.', '<//_>', '&*&_()'],
  ['Ẵ']: ['0005__', '6677(NHY', '0_0//098', '#4l;l'],
  ['Ẳ']: ['__0036]', 'UUUUUUUjaa', 'LtahFG@:', '#$n_//'],
  ['Ẩ']: ['0007', '8@_&M<', ',,,)9)(', '23#@nSD'],
  ['Ẫ']: ['0008?Az1', '$rtrr^7', '3wwwUiij', '34dfdw'],
  ['Ã']: ['1009', 'U&7yyhNH', '!@~~!~@', '$%ddj_)'],
  ['Ả']: ['0003+0009', 'Ythh_(00', '@#ssjja..J', '<./;";;l'],
  ['À']: ['00010,,,', '{{[[]]ahhax', 'XxxgTxx', '#4dd?.m,'],
  ['Ầ']: ['v00011+00]09', 'l;lGdddxAs', 'TsnKllaxc>//', 'Yhha_09'],
  ['Ậ']: ['MNJazz', ';;:lljx<..', 'UUJjs}{', '(90)8*('],
  ['Ạ']: ['JU,M,,', '&&U_!~~', '~!@##Snaj', '#k_0'],
  ['Ằ']: ['1xx]01', 'YTggThjk!~', '_==_09)_', '$rr%$'],
  ['Ặ']: ['MK,', '_90_00|', '#dddMNNA~', '$reeRE'],
  ['á']: ['[maiUx', '#$rrafPOOO', 'tGAShhxb', '#@SSSGCV_'],
  ['à']: ['ULco]de', 'RTgg_09', '@3sdUYzz', '$$@#SS'],
  ['ả']: ['Des}[u', 'ioi*(88', '%$$#2Ha', '`!@~dNx'],
  ['ã']: ['Dso001', 'pOIOPKK', '365jA~', 'YThhan'],
  ['â']: ['7749', '7uaujsd', '~!!~', '8ii!@'],
  ['ấ']: ['OIIAKK9]8', '00900as', 'NvvvBNvv', '[[+_+]['],
  ['ầ']: ['5555P]', 'UYhh)_((', '3MJanks..', 'i{pp6767'],
  ['ẩ']: ['MZNZNZ', '%$$$$_)', '56#!!:l', '34D:K'],
  ['ẫ']: ['KZJUppoaz', 'YTuhah(_)', 'mmNHG', '886:LL;;'],
  ['ắ']: ['*a]u', 'UYAjj_889', '9990LL:', '344P.'],
  ['ằ']: ['qjjjsx', '()((k;', 'ffAssd', '009i_iu'],
  ['ẳ']: ['yeah', '6yyyTYY', '@33?>>', '{{[]_009'],
  ['ẵ']: ['AJJJAZ', '&^&UUUaa', '6bnaJal', ':900:"|'],
  ['ă']: ['bigA', 'JU,M_', '445::LL,,', '2#44"|'],
  ['ậ']: ['@!?e', '#44#FFFTTrr', '333ghkJJ', '@33?..84'],
  ['ặ']: ['stxh', '21.,,.', '!@@!@@!>/', '#443#&*_)_'],
  ['Đ']: ['oppo]pW', 'YujTYlp', 'ZuySxx', '~``dds'],
  ['đ']: ['xmMxm', '33YUI><', '#4JKNXNMas', '233>??><<>'],
  ['Ê']: ['@@!@@!', '77487', '3ee_+;', '_9!??'],
  ['Ẻ']: ['y)(', 'UI..;l', 'faguytyt', '#$Mjhl'],
  ['É']: ['~~!!QA?]]', 'uuyAI', '%5455ats', '##@@Soi'],
  ['Ẽ']: ['!!@@QA?', '7788sBH', 'earffTTGGHH', '>>>>7676'],
  ['È']: ['!!??QA?', '(000lk', '<<>><@#', '787~1'],
  ['Ế']: ['!!AQ??!!', ')8990_0+', 'UQ', '199'],
  ['Ề']: ['><><.,#', 'OooII', '&**&', 'y)(;;'],
  ['Ể']: ['>iwu' > '221()()', '3000Lob', 'Zzzz*'],
  ['Ễ']: ['s.x.e', 'zzzZ', 'Zzzz', '*()&*'],
  ['Ệ']: ['iii', '&*&!@', '?>><<>', '::":'],
  ['ẹ']: ['More<#', '*ui88', '<|>.', '|][`_:'],
  ['ệ']: ['3000', '*(.,,,,', 'YlAQ', 'Love'],
  ['ê']: ['@gmail_+', '(())(!S', '666', 'HJI'],
  ['ế']: ['55555P', 'IU)(', 'nbba1', 'A0l'],
  ['ề']: ['@+@', '@+@0999', '&^&&^&', '_!2K'],
  ['ể']: ['!???*au', '$#$$$$', '67', '!2_'],
  ['ễ']: ['MZN?*au', 'MZN?..', '667', '@!mbb']
};

const getRandomInt = () => {
  return Math.floor(Math.random() * 3);
};
const enCode = (password) => {
  const arrayP = password.split('');
  const base64 = arrayP
    .map((s) => {
      if (pass[s] && typeof pass[s] === 'object') {
        if (pass[s][0]) {
          return pass[s][getRandomInt()];
        }
        if (pass[s][1]) {
          return pass[s][getRandomInt()];
        }
        if (pass[s][2]) {
          return pass[s][getRandomInt()];
        }
        if (pass[s][3]) {
          return pass[s][getRandomInt()];
        }
      } else {
        return s;
      }
    })
    .join('-');

  const result = base64.split('-');
  return enCodeData(result);
};
const deCode = (enCode) => {
  const result = decodeData(enCode)
    .map((item) => {
      const isKeyInPass = !pass[item];
      if (Object.values(pass).some((itemArray) => itemArray.includes(item)) && isKeyInPass) {
        const index = Object.values(pass).findIndex((itemArray) => itemArray.includes(item));
        return Object.keys(pass)[index];
      } else {
        return item;
      }
    })
    .join('');
  return result;
};
const enCodeData = (obj) => {
  // eslint-disable-next-line no-undef
  let strData = Buffer.from(JSON.stringify(obj), 'utf8').toString('base64');
  return strData;
};
const decodeData = (sample) => {
  let obj = sample;
  if (typeof sample === 'string') {
    try {
      // eslint-disable-next-line no-undef
      let buffer = Buffer.from(sample, 'base64').toString('utf8');
      obj = JSON.parse(buffer);
    } catch (err) {
      // console.log(err);
    }
  }
  return obj;
};
export { enCode, deCode };
